MikroElektronika/core_packages/ARM/gcc_clang/def/silabs/EFM32PG26B501F3200IL136/mcu.h
/* Part number capabilities */
#define ACMP_PRESENT                                /** ACMP is available in this part */
#define ACMP_COUNT                               2  /** 2 ACMPs available  */
#define AMUXCP_PRESENT                              /** AMUXCP is available in this part */
#define AMUXCP_COUNT                             1  /** 1 AMUXCPs available  */
#define BURAM_PRESENT                               /** BURAM is available in this part */
#define BURAM_COUNT                              1  /** 1 BURAMs available  */
#define BURTC_PRESENT                               /** BURTC is available in this part */
#define BURTC_COUNT                              1  /** 1 BURTCs available  */
#define CMU_PRESENT                                 /** CMU is available in this part */
#define CMU_COUNT                                1  /** 1 CMUs available  */
#define DCDC_PRESENT                                /** DCDC is available in this part */
#define DCDC_COUNT                               1  /** 1 DCDCs available  */
#define DMEM_PRESENT                                /** DMEM is available in this part */
#define DMEM_COUNT                               2  /** 2 DMEMs available  */
#define DPLL_PRESENT                                /** DPLL is available in this part */
#define DPLL_COUNT                               1  /** 1 DPLLs available  */
#define EMU_PRESENT                                 /** EMU is available in this part */
#define EMU_COUNT                                1  /** 1 EMUs available  */
#define EUSART_PRESENT                              /** EUSART is available in this part */
#define EUSART_COUNT                             4  /** 4 EUSARTs available  */
#define FSRCO_PRESENT                               /** FSRCO is available in this part */
#define FSRCO_COUNT                              1  /** 1 FSRCOs available  */
#define GPCRC_PRESENT                               /** GPCRC is available in this part */
#define GPCRC_COUNT                              1  /** 1 GPCRCs available  */
#define GPIO_PRESENT                                /** GPIO is available in this part */
#define GPIO_COUNT                               1  /** 1 GPIOs available  */
#define HFRCO_PRESENT                               /** HFRCO is available in this part */
#define HFRCO_COUNT                              1  /** 1 HFRCOs available  */
#define HFRCOEM23_PRESENT                           /** HFRCOEM23 is available in this part */
#define HFRCOEM23_COUNT                          1  /** 1 HFRCOEM23s available  */
#define HFXO_PRESENT                                /** HFXO is available in this part */
#define HFXO_COUNT                               1  /** 1 HFXOs available  */
#define HOSTMAILBOX_PRESENT                         /** HOSTMAILBOX is available in this part */
#define HOSTMAILBOX_COUNT                        1  /** 1 HOSTMAILBOXs available  */
#define I2C_PRESENT                                 /** I2C is available in this part */
#define I2C_COUNT                                4  /** 4 I2Cs available  */
#define IADC_PRESENT                                /** IADC is available in this part */
#define IADC_COUNT                               1  /** 1 IADCs available  */
#define ICACHE_PRESENT                              /** ICACHE is available in this part */
#define ICACHE_COUNT                             1  /** 1 ICACHEs available  */
#define KEYSCAN_PRESENT                             /** KEYSCAN is available in this part */
#define KEYSCAN_COUNT                            1  /** 1 KEYSCANs available  */
#define LCD_PRESENT                                 /** LCD is available in this part */
#define LCD_COUNT                                1  /** 1 LCDs available  */
#define LCDRF_PRESENT                               /** LCDRF is available in this part */
#define LCDRF_COUNT                              1  /** 1 LCDRFs available  */
#define LDMA_PRESENT                                /** LDMA is available in this part */
#define LDMA_COUNT                               1  /** 1 LDMAs available  */
#define LDMAXBAR_PRESENT                            /** LDMAXBAR is available in this part */
#define LDMAXBAR_COUNT                           1  /** 1 LDMAXBARs available  */
#define LETIMER_PRESENT                             /** LETIMER is available in this part */
#define LETIMER_COUNT                            1  /** 1 LETIMERs available  */
#define LFRCO_PRESENT                               /** LFRCO is available in this part */
#define LFRCO_COUNT                              1  /** 1 LFRCOs available  */
#define LFXO_PRESENT                                /** LFXO is available in this part */
#define LFXO_COUNT                               1  /** 1 LFXOs available  */
#define MSC_PRESENT                                 /** MSC is available in this part */
#define MSC_COUNT                                1  /** 1 MSCs available  */
#define PCNT_PRESENT                                /** PCNT is available in this part */
#define PCNT_COUNT                               1  /** 1 PCNTs available  */
#define PRS_PRESENT                                 /** PRS is available in this part */
#define PRS_COUNT                                1  /** 1 PRSs available  */
#define SEMAILBOX_PRESENT                           /** SEMAILBOX is available in this part */
#define SEMAILBOX_COUNT                          1  /** 1 SEMAILBOXs available  */
#define SMU_PRESENT                                 /** SMU is available in this part */
#define SMU_COUNT                                1  /** 1 SMUs available  */
#define SYSCFG_PRESENT                              /** SYSCFG is available in this part */
#define SYSCFG_COUNT                             1  /** 1 SYSCFGs available  */
#define SYSRTC_PRESENT                              /** SYSRTC is available in this part */
#define SYSRTC_COUNT                             1  /** 1 SYSRTCs available  */
#define TIMER_PRESENT                               /** TIMER is available in this part */
#define TIMER_COUNT                              10 /** 10 TIMERs available  */
#define ULFRCO_PRESENT                              /** ULFRCO is available in this part */
#define ULFRCO_COUNT                             1  /** 1 ULFRCOs available  */
#define USART_PRESENT                               /** USART is available in this part */
#define USART_COUNT                              3  /** 3 USARTs available  */
#define VDAC_PRESENT                                /** VDAC is available in this part */
#define VDAC_COUNT                               2  /** 2 VDACs available  */
#define WDOG_PRESENT                                /** WDOG is available in this part */
#define WDOG_COUNT                               2  /** 2 WDOGs available  */
#define DEVINFO_PRESENT                             /** DEVINFO is available in this part */
#define DEVINFO_COUNT                            1  /** 1 DEVINFOs available  */

/* Include standard ARM headers for the core */
// #include "core_cm33.h"        /* Core Header File */  // Note: Changed for MikroE implementation.
// #include "system_efm32pg26.h" /* System Header File */  // Note: Changed for MikroE implementation.
#include <stdint.h>
#define     __I     volatile const       /*!< Defines 'read only' permissions */
#define     __O     volatile             /*!< Defines 'write only' permissions */
#define     __IO    volatile             /*!< Defines 'read / write' permissions */

/* following defines should be used for structure members */
#define     __IM     volatile const      /*! Defines 'read only' structure member permissions */
#define     __OM     volatile            /*! Defines 'write only' structure member permissions */
#define     __IOM    volatile            /*! Defines 'read / write' structure member permissions */

